# vstGetEventResult

## Description
```pascal
PROCEDURE vstGetEventResult(VAR outGetVal : LONGINT);
```

```python

def vs.vstGetEventResult():
    return outGetVal
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outGetVal|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events